sergev/pic32prog/adapter-mpsse.c
/*
 * Interface to PIC32 JTAG port using FT2232-based USB adapter.
 * Supported hardware:
 *  - Olimex ARM-USB-Tiny adapter
 *  - Olimex ARM-USB-Tiny-H adapter
 *  - Olimex ARM-USB-OCD-H adapter
 *  - Olimex MIPS-USB-OCD-H adapter
 *  - Bus Blaster v2 from Dangerous Prototypes
 *  - TinCanTools Flyswatter adapter
 *
 * Copyright (C) 2011-2013 Serge Vakulenko
 *
 * This file is part of PIC32PROG project, which is distributed
 * under the terms of the GNU General Public License (GPL).
 * See the accompanying file "COPYING" for more details.
 */
#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>
#include <fcntl.h>
#include <string.h>
#include <errno.h>
#if defined(__FreeBSD__) || defined(__DragonFly__)
#   include <libusb.h>
#else
#   include <libusb-1.0/libusb.h>
#endif

#include "adapter.h"
#include "pic32.h"

typedef struct {
    uint16_t vid;
    uint16_t pid;
    const char *name;
    uint8_t mhz;
    uint16_t dir_control;
    uint16_t trst_control;
    uint8_t trst_inverted;
    uint16_t sysrst_control;
    uint8_t sysrst_inverted;
    uint16_t led_control;
    uint8_t led_inverted;
    const char *product;
    uint16_t extra_output;      /* Default OE settings, etc. */
    uint16_t icsp_control;      /* Selecting ICSP mode. 0 == JTAG, 1 == ICSP */
    uint16_t icsp_inverted; 
    uint16_t icsp_oe_control;   /* Selecting data direction in ICSP mode. 0 == OUTPUT, 1 == INPUT */
    uint16_t icsp_oe_inverted;
} device_t;

typedef struct {
    /* Common part */
    adapter_t adapter;
    const char *name;

    /* Device handle for libusb. */
    libusb_device_handle *usbdev;
    libusb_context *context;

    /* Transmit buffer for MPSSE packet. */
    unsigned char output [256*16];
    int bytes_to_write;

    /* Receive buffer. */
    unsigned char input [256];  /* Increased for ICSP, just in case */
    int bytes_to_read;
    int bytes_per_word;
    unsigned long long fix_high_bit;
    unsigned long long high_byte_mask;
    unsigned long long high_bit_mask;
    unsigned high_byte_bits;

    /* Mapping of /TRST, /SYSRST and LED control signals. */
    unsigned trst_control, trst_inverted;
    unsigned sysrst_control, sysrst_inverted;
    unsigned led_control, led_inverted;
    unsigned icsp_control, icsp_inverted;
    unsigned icsp_oe_control, icsp_oe_inverted;
    unsigned dir_control;
    unsigned extra_output;

    unsigned mhz;
    unsigned interface;
    unsigned use_executive;
    unsigned serial_execution_mode;
} mpsse_adapter_t;

/*
 * Identifiers of USB adapter.
 */
#define OLIMEX_VID              0x15ba
#define OLIMEX_ARM_USB_TINY     0x0004  /* ARM-USB-Tiny */
#define OLIMEX_ARM_USB_TINY_H   0x002a  /* ARM-USB-Tiny-H */
#define OLIMEX_ARM_USB_OCD_H    0x002b  /* ARM-USB-OCD-H */
#define OLIMEX_MIPS_USB_OCD_H   0x0036  /* MIPS-USB-OCD-H */

#define FTDI_DEFAULT_VID        0x0403  /* Neofoxx JTAG/SWD debug probe, Bus Blaster v2, Flyswatter, ...*/
#define FTDI_DEFAULT_PID        0x6010

/*
 * USB endpoints.
 */
#define IN_EP                   0x02
#define OUT_EP                  0x81

/* Requests */
#define SIO_RESET               0 /* Reset the port */
#define SIO_MODEM_CTRL          1 /* Set the modem control register */
#define SIO_SET_FLOW_CTRL       2 /* Set flow control register */
#define SIO_SET_BAUD_RATE       3 /* Set baud rate */
#define SIO_SET_DATA            4 /* Set the data characteristics of the port */
#define SIO_POLL_MODEM_STATUS   5
#define SIO_SET_EVENT_CHAR      6
#define SIO_SET_ERROR_CHAR      7
#define SIO_SET_LATENCY_TIMER   9
#define SIO_GET_LATENCY_TIMER   10
#define SIO_SET_BITMODE         11
#define SIO_READ_PINS           12
#define SIO_READ_EEPROM         0x90
#define SIO_WRITE_EEPROM        0x91
#define SIO_ERASE_EEPROM        0x92

/* MPSSE commands. */
#define CLKWNEG                 0x01
#define BITMODE                 0x02
#define CLKRNEG                 0x04
#define LSB                     0x08
#define WTDI                    0x10
#define RTDO                    0x20
#define WTMS                    0x40

/* TMS header and footer defines */
#define TMS_HEADER_COMMAND_NBITS        4
#define TMS_HEADER_COMMAND_VAL          0b0011
#define TMS_HEADER_XFERDATA_NBITS       3
#define TMS_HEADER_XFERDATA_VAL         0b001
#define TMS_HEADER_XFERDATAFAST_NBITS   3
#define TMS_HEADER_XFERDATAFAST_VAL     0b001
#define TMS_HEADER_RESET_TAP_NBITS      6
#define TMS_HEADER_RESET_TAP_VAL        0b011111

#define TMS_FOOTER_COMMAND_NBITS        2
#define TMS_FOOTER_COMMAND_VAL          0b01
#define TMS_FOOTER_XFERDATA_NBITS       2
#define TMS_FOOTER_XFERDATA_VAL         0b01
#define TMS_FOOTER_XFERDATAFAST_NBITS   2
#define TMS_FOOTER_XFERDATAFAST_VAL     0b01

#define SET_MODE_TAP_RESET  0
#define SET_MODE_EXIT       1
#define SET_MODE_ICSP_SYNC  2

static const device_t devlist[] = {
    { OLIMEX_VID,           OLIMEX_ARM_USB_TINY,    "Olimex ARM-USB-Tiny",               6,  0x0f10, 0x0100, 1,  0x0200,  0,   0x0800,  0, NULL, 0x0000, 0x0100, 1, 0x0008, 1},
    { OLIMEX_VID,           OLIMEX_ARM_USB_TINY_H,  "Olimex ARM-USB-Tiny-H",            30,  0x0f10, 0x0100, 1,  0x0200,  0,   0x0800,  0, NULL, 0x0000, 0x0100, 1, 0x0008, 1},
    { OLIMEX_VID,           OLIMEX_ARM_USB_OCD_H,   "Olimex ARM-USB-OCD-H",             30,  0x0f10, 0x0100, 1,  0x0200,  0,   0x0800,  0, NULL, 0x0000, 0x0100, 1, 0x0008, 1},
    { OLIMEX_VID,           OLIMEX_MIPS_USB_OCD_H,  "Olimex MIPS-USB-OCD-H",            30,  0x0f10, 0x0100, 1,  0x0200,  1,   0x0800,  0, NULL, 0x0000, 0x0100, 1, 0x0008, 1},
    { FTDI_DEFAULT_VID,     FTDI_DEFAULT_PID,       "TinCanTools Flyswatter",            6,  0x0cf0, 0x0010, 1,  0x0020,  1,   0x0c00,  1, "Flyswatter", 0x0000, 0x0100, 1, 0x0008, 1},
    { FTDI_DEFAULT_VID,     FTDI_DEFAULT_PID,       "Neofoxx JTAG/SWD adapter",         30,  0xff3b, 0x0100, 1,  0x0200,  1,   0x8000,  1, "Neofoxx JTAG/SWD adapter", 0x0000, 0x0020, 1, 0x1000, 0},
    { FTDI_DEFAULT_VID,     FTDI_DEFAULT_PID,       "Dangerous Prototypes Bus Blaster", 30,  0x0f10, 0x0100, 1,  0x0200,  1,   0x0000,  0, NULL, 0x0000, 0x0100, 1, 0x0008, 1},
    { 0 }
};

