sergev/pic32prog/adapter-mpsse.c
    /* Send a packet. */
    mpsse_flush_output(a);

    /* Process a reply: one 64-bit word. */
    memcpy(&word, a->input, sizeof(word));
    return mpsse_fix_data(a, word);
}

/*  Renamed function to mpsse_setPins, since it does more than just reset. 
 *  Now controls state of reset (always SYSRST), LED,
 *  ICSP select and ICSP output enable pins */

static void mpsse_setPins(mpsse_adapter_t *a, int sysrst, int led,
                            int icsp, int icsp_oe, int immediateWrite)
{
    unsigned output    = 0x0008 | a->extra_output;  /* TMS idle high, OE pins etc. */
    unsigned direction = 0x000b | a->dir_control;

    if (sysrst)
        output |= a->sysrst_control;
    if (a->sysrst_inverted)
        output ^= a->sysrst_control;

    if (led)
        output |= a->led_control;
    if (a->led_inverted)
        output ^= a->led_control;

    if (icsp)
        output |= a->icsp_control;
    if (a->icsp_inverted)
        output ^= a->icsp_control;

    if (icsp){
		if (output & a->icsp_oe_control){
            output ^= a->icsp_oe_control; /* Fix for boards that use TMS as OE */
		}
		if (icsp_oe)
		    output |= a->icsp_oe_control;
		if (a->icsp_oe_inverted)
		    output ^= a->icsp_oe_control;
	}

    /* command "set data bits low byte" */
    a->output [a->bytes_to_write++] = 0x80;
    a->output [a->bytes_to_write++] = output;
    a->output [a->bytes_to_write++] = direction;

    /* command "set data bits high byte" */
    a->output [a->bytes_to_write++] = 0x82;
    a->output [a->bytes_to_write++] = output >> 8;
    a->output [a->bytes_to_write++] = direction >> 8;

    if (immediateWrite)
        mpsse_flush_output(a);

    if (debug_level>1)
        fprintf(stderr, "mpsse_setPins(sysrst=%d, led=%d, icsp=%d, icsp_oe=%d)\
                         output=%04x, direction: %04x\n",
                        sysrst, led, icsp, icsp_oe, output, direction);
}

static uint32_t mpsse_bitReversal(uint32_t input){
    uint32_t output = 0;
    uint32_t counter = 0;
    for(counter=0; counter<32; counter++){
        if(input & (1<<counter)){
            output = output | (1<<(31-counter));
        }
    }
    return output;
}

static void mpsse_setMode(mpsse_adapter_t *a, uint32_t mode, uint32_t immediate){
    
    if (SET_MODE_TAP_RESET == mode){
        /* TMS 1-1-1-1-1-0 */
        mpsse_send(a, TMS_HEADER_RESET_TAP_NBITS, TMS_HEADER_RESET_TAP_VAL, 0, 0, 0, 0, 0);
    }
    else if (SET_MODE_EXIT == mode){
        /* TMS 1-1-1-1-1 */
        mpsse_send(a, 5, 0x1F, 0, 0, 0, 0, 0);
    }
    else if (SET_MODE_ICSP_SYNC == mode && (INTERFACE_JTAG == a->interface || INTERFACE_DEFAULT == a->interface)){
        // In JTAG mode, send the MCHP key to enter ICSP on the TMS line.
		uint32_t entryCode = 0x4D434850;   // MCHP in ascii.
		entryCode = mpsse_bitReversal(entryCode);
		mpsse_send(a, 8, entryCode & 0xFF, 0, 0, 0, 0, 0);
		mpsse_send(a, 8, (entryCode >> 8) & 0xFF, 0, 0, 0, 0, 0);
		mpsse_send(a, 8, (entryCode >> 16) & 0xFF, 0, 0, 0, 0, 0);
		mpsse_send(a, 8, (entryCode >> 24) & 0xFF, 0, 0, 0, 0, 0);

    }
    else{
        fprintf(stderr, "mpsse_setMode called with invalid mode, quitting\n");
        exit(-1);
    }
    if (immediate){
        mpsse_flush_output(a);
    }
}

static void mpsse_sendCommand(mpsse_adapter_t *a, uint32_t command, uint32_t immediate){
    // All 5-bit commands. The 8-bit ones are command_DR, go through XferData
    if (MTAP_COMMAND != command && TAP_SW_MTAP != command       // MTAP commands
        && TAP_SW_ETAP != command && MTAP_IDCODE != command     // MTAP commands
        && ETAP_ADDRESS != command && ETAP_DATA != command      // ETAP commands
        && ETAP_CONTROL != command && ETAP_EJTAGBOOT != command // ETAP commands
        && ETAP_FASTDATA != command && ETAP_NORMALBOOT != command){ // ETAP commands
        fprintf(stderr, "mpsse_sendCommand called with invalid command 0x%02x, quitting\n", command);
        exit(-1);   // TODO make exit procedure
    }

    if (MTAP_COMMAND != command && TAP_SW_MTAP != command 
        && TAP_SW_ETAP != command && MTAP_IDCODE != command){   // MTAP commands
        mpsse_send(a, TMS_HEADER_COMMAND_NBITS, TMS_HEADER_COMMAND_VAL,
                    MTAP_COMMAND_NBITS, command,
                    TMS_FOOTER_COMMAND_NBITS, TMS_FOOTER_COMMAND_VAL,
                    0);
    }
    else if (ETAP_ADDRESS != command && ETAP_DATA != command    // ETAP commands
            && ETAP_CONTROL != command && ETAP_EJTAGBOOT != command 
            && ETAP_FASTDATA != command && ETAP_NORMALBOOT != command){
        mpsse_send(a, TMS_HEADER_COMMAND_NBITS, TMS_HEADER_COMMAND_VAL,
                    ETAP_COMMAND_NBITS, command,
                    TMS_FOOTER_COMMAND_NBITS, TMS_FOOTER_COMMAND_VAL,
                    0);
    }
    if (immediate){
        mpsse_flush_output(a);
    }

}


static uint64_t mpsse_xferData(mpsse_adapter_t *a, uint32_t nBits, 
                uint32_t iData, uint32_t readFlag, uint32_t immediate){
    mpsse_send(a, TMS_HEADER_XFERDATA_NBITS, TMS_HEADER_XFERDATA_VAL,
                    nBits, iData, 
                    TMS_FOOTER_XFERDATA_NBITS, TMS_FOOTER_XFERDATA_VAL,
                    readFlag);
    if (readFlag){
        /* Flushes the output data, and returns the data */
        return mpsse_recv(a);
    }
    if (immediate){
        mpsse_flush_output(a);
    }
    return 0;
}

static uint64_t mpsse_xferFastData(mpsse_adapter_t *a, unsigned word, uint32_t readFlag, uint32_t immediate)
{
    uint64_t temp;
    mpsse_send(a, TMS_HEADER_XFERDATAFAST_NBITS, TMS_HEADER_XFERDATAFAST_VAL,
                    33, (unsigned long long) word << 1,
                    TMS_FOOTER_XFERDATAFAST_NBITS, TMS_FOOTER_XFERDATAFAST_VAL,
                    1);
    temp = mpsse_recv(a);
    if (!(temp & 0x01)){
        fprintf(stderr, "Warning: PrACC not set in xferFastData\n");
    }
    if (readFlag){
        return temp;
    }
    return 0;
}

static void mpsse_xferInstruction(mpsse_adapter_t *a, unsigned instruction)
{
    unsigned ctl;
    unsigned maxCounter = 0;

