sergev/pic32prog/adapter-mpsse.c
    if (debug_level > 1)
        fprintf(stderr, "%s: xfer instruction %08x\n", a->name, instruction);

    /* Select Control Register */
    mpsse_sendCommand(a, ETAP_CONTROL, 1); // ETAP_CONTROL, immediate

    // Wait until CPU is ready
    // Check if Processor Access bit (bit 18) is set
    do {
        ctl = mpsse_xferData(a, 32, (CONTROL_PRACC | CONTROL_PROBEN 
            | CONTROL_PROBTRAP | CONTROL_EJTAGBRK), 1, 1);    // Send data, readflag, immediate don't care
        if ((! (ctl & CONTROL_PRACC))){
            fprintf(stderr, "xfer instruction, ctl was %08x\n", ctl);
            maxCounter++;
            if (maxCounter > 4){
                fprintf(stderr, "Processor still not ready. Quitting\n");
                exit(-1);   // TODO exit procedure
            }
            mdelay(1000);
        }
    } while (! (ctl & CONTROL_PRACC));

    /* Select Data Register */
    mpsse_sendCommand(a, ETAP_DATA, 1);    // ETAP_DATA, immediate

    /* Send the instruction */
    mpsse_xferData(a, 32, instruction, 0, 1);  // Send instruction, don't read, immediate

    /* Tell CPU to execute instruction */
    mpsse_sendCommand(a, ETAP_CONTROL, 1); // ETAP_CONTROL, immediate
    /* Send data. */
    mpsse_xferData(a, 32, (CONTROL_PROBEN | CONTROL_PROBTRAP), 0, 1);   // Send data, no readback, immediate
}

static void mpsse_speed(mpsse_adapter_t *a, int khz)
{
    unsigned char output [3];
    int divisor = (a->mhz * 2000 / khz + 1) / 2 - 1;

    if (divisor < 0)
        divisor = 0;
    if (debug_level)
        fprintf(stderr, "%s: divisor: %u\n", a->name, divisor);

    if (a->mhz > 6) {
        /* Use 60MHz master clock (disable divide by 5). */
        output [0] = 0x8A;

        /* Turn off adaptive clocking. */
        output [1] = 0x97;

        /* Disable three-phase clocking. */
        output [2] = 0x8D;
        bulk_write(a, output, 3);
    }

    /* Command "set TCK divisor". */
    output [0] = 0x86;
    output [1] = divisor;
    output [2] = divisor >> 8;
    bulk_write(a, output, 3);

    if (debug_level) {
        khz = (a->mhz * 2000 / (divisor + 1) + 1) / 2;
        fprintf(stderr, "%s: clock rate %.1f MHz\n", a->name, khz / 1000.0);
    }
}

static void mpsse_close(adapter_t *adapter, int power_on)
{
    mpsse_adapter_t *a = (mpsse_adapter_t*) adapter;

    /* Clear EJTAGBOOT mode. */
    /* Send command. */
    mpsse_send(a, TMS_HEADER_COMMAND_NBITS, TMS_HEADER_COMMAND_VAL,
                    MTAP_COMMAND_NBITS, TAP_SW_ETAP,
                    TMS_FOOTER_COMMAND_NBITS, TMS_FOOTER_COMMAND_VAL,
                    0);
    /* TMS 1-1-1-1-1-0 */
    mpsse_send(a, TMS_HEADER_RESET_TAP_NBITS, TMS_HEADER_RESET_TAP_VAL,
                0, 0, 0, 0, 0);
    mpsse_flush_output(a);

    /* Toggle /SYSRST. */
    mpsse_setPins(a, 1, 1, 0, 0, 1); // Reset, LED, no ICSP, no ICSP_OE, immediate
    mdelay(100);    /* Hold in reset for a bit, so it auto-runs afterwards */
    mpsse_setPins(a, 0, 0, 0, 0, 1); // No Reset, no LED, no ICSP, no ICSP_OE, immediate

    libusb_release_interface(a->usbdev, 0);
    libusb_close(a->usbdev);
    free(a);
}

/*
 * Read the Device Identification code
 */
static unsigned mpsse_get_idcode(adapter_t *adapter)
{
    mpsse_adapter_t *a = (mpsse_adapter_t*) adapter;
    unsigned idcode;

    /* Reset the JTAG TAP controller: TMS 1-1-1-1-1-0.
     * After reset, the IDCODE register is always selected.
     * Read out 32 bits of data. */
    mpsse_setMode(a, SET_MODE_TAP_RESET, 1);    /* Send TAP reset, immediate */
    idcode = mpsse_xferData(a, 32, 0, 1, 1);    /* Send 32 0s, receive, immediate (don't care) */
    return idcode;
}

/*
 * Put device to serial execution mode.
 */
static void serial_execution(mpsse_adapter_t *a)
{
    if (a->serial_execution_mode)
        return;
    a->serial_execution_mode = 1;

    /* Enter serial execution. */
    if (debug_level > 0)
        fprintf(stderr, "%s: enter serial execution\n", a->name);

    /* Reset TAP */
    mpsse_setMode(a, SET_MODE_TAP_RESET, 1);    // Reset TAP, immediate
    /* Switch to ETAP */
    mpsse_sendCommand(a, TAP_SW_ETAP, 1);   // Send command, immediate
    /* Reset TAP */
    mpsse_setMode(a, SET_MODE_TAP_RESET, 1);    // Reset TAP, immediate
    /* Put CPU in Serial Exec Mode */
    mpsse_sendCommand(a, ETAP_EJTAGBOOT, 1); // Send command, immediate

    /* Check status. */
    /* Send command. */
    mpsse_sendCommand(a, TAP_SW_MTAP, 0);  // Command, not immediate
    /* Send command. */
    mpsse_sendCommand(a, MTAP_COMMAND, 0);
    /* Xfer data. */
    mpsse_xferData(a, MTAP_COMMAND_DR_NBITS, MCHP_DEASSERT_RST, 0, 1);
    /* Xfer data. */
    mpsse_xferData(a, MTAP_COMMAND_DR_NBITS, MCHP_FLASH_ENABLE, 0, 1);  
    /* Get status */
    unsigned status = mpsse_xferData(a, MTAP_COMMAND_DR_NBITS, MCHP_STATUS, 1, 1);
    if (debug_level > 0)
        fprintf(stderr, "%s: status %04x\n", a->name, status);
    if ((status & ~MCHP_STATUS_DEVRST) !=
        (MCHP_STATUS_CPS | MCHP_STATUS_CFGRDY | MCHP_STATUS_FAEN)) {
        fprintf(stderr, "%s: invalid status = %04x (reset)\n", a->name, status);
        exit(-1);
    }

    /* Deactivate /SYSRST. */
    mpsse_setPins(a, 0, 1, 0, 0, 1); // No Reset, LED, no ICSP, no ICSP_OE, immediate
    mdelay(10);

    /* Check status. */
    /* Send command. */
    mpsse_sendCommand(a, TAP_SW_MTAP, 0);  // Command, not immediate
    /* Send command. */
    mpsse_sendCommand(a, MTAP_COMMAND, 0);
    /* Get status */
    status = mpsse_xferData(a, MTAP_COMMAND_DR_NBITS, MCHP_STATUS, 1, 1);
    if (debug_level > 0)
        fprintf(stderr, "%s: status %04x\n", a->name, status);
    if (status != (MCHP_STATUS_CPS | MCHP_STATUS_CFGRDY |
                   MCHP_STATUS_FAEN)) {
        fprintf(stderr, "%s: invalid status = %04x (no reset)\n", a->name, status);
        exit(-1);
    }

    /* Leave it in ETAP mode. */
    mpsse_sendCommand(a, TAP_SW_ETAP, 1);
}

static unsigned get_pe_response(mpsse_adapter_t *a)
{
    unsigned ctl, response;

    // Select Control Register
    /* Send command. */
    mpsse_sendCommand(a, ETAP_CONTROL, 1);

    // Wait until CPU is ready
    // Check if Processor Access bit (bit 18) is set
    do {
        ctl = mpsse_xferData(a, 32, (CONTROL_PRACC | CONTROL_PROBEN 
                | CONTROL_PROBTRAP | CONTROL_EJTAGBRK), 1, 1);    // Send data, readflag, immediate don't care
    } while (! (ctl & CONTROL_PRACC));

    // Select Data Register
    // Send the instruction
    /* Send command. */
    mpsse_sendCommand(a, ETAP_DATA, 1);

