sergev/pic32prog/adapter-mpsse.c
/*
 * Erase all flash memory.
 */
static void mpsse_erase_chip(adapter_t *adapter)
{
    mpsse_adapter_t *a = (mpsse_adapter_t*) adapter;
    unsigned status = 0;

    /* Switch to MTAP */
    mpsse_sendCommand(a, TAP_SW_MTAP, 1);
    /* Reset TAP */
    mpsse_setMode(a, SET_MODE_TAP_RESET, 1);
    /* Send command. */
    mpsse_sendCommand(a, MTAP_COMMAND, 1);
    /* Xfer data. */
    mpsse_xferData(a, MTAP_COMMAND_DR_NBITS, MCHP_ERASE, 0, 1);
    mpsse_xferData(a, MTAP_COMMAND_DR_NBITS, MCHP_DEASSERT_RST, 0, 1);

    // https://www.microchip.com/forums/m627418.aspx .......
    if (INTERFACE_JTAG == a->interface || INTERFACE_DEFAULT == a->interface){
        mpsse_setPins(a, 0, 1, 0, 0, 1);  /* No Reset, LED, no ICSP, no ICSP_OE, immediate */
    }

    do{
        status = mpsse_xferData(a, MTAP_COMMAND_DR_NBITS, MCHP_STATUS, 1, 1);  // Send data, read response, immediate don't care
        //fprintf(stderr, "Status is 0x%08x ... \n", statuss);
        if (!(status & MCHP_STATUS_CFGRDY) || (status & MCHP_STATUS_FCBUSY)){
            printf(".");
            mdelay(10);
        }
    }while(!(status & MCHP_STATUS_CFGRDY) || (status & MCHP_STATUS_FCBUSY));

    mpsse_setMode(a, SET_MODE_TAP_RESET, 1); 
    mdelay(25);
}

/*
 * Write a word to flash memory.
 */
static void mpsse_program_word(adapter_t *adapter,
    unsigned addr, unsigned word)
{
    mpsse_adapter_t *a = (mpsse_adapter_t*) adapter;

    if (debug_level > 0)
        fprintf(stderr, "%s: program word at %08x: %08x\n", a->name, addr, word);
    if (! a->use_executive) {
        /* Without PE. */
        fprintf(stderr, "%s: slow flash write not implemented yet.\n", a->name);
        exit(-1);
    }

    /* Use PE to write flash memory. */
    /* Send command. */
    mpsse_sendCommand(a, ETAP_FASTDATA, 1);

    mpsse_xferFastData(a, PE_WORD_PROGRAM << 16 | 2, 0, 1); // Data, don't read, immediate
    mpsse_xferFastData(a, addr, 0, 1);  /* Send address. */ // Data, don't read, immediate
    mpsse_xferFastData(a, word, 0, 1);  /* Send word. */    // Data, don't read, immediate

    unsigned response = get_pe_response(a);
    if (response != (PE_WORD_PROGRAM << 16)) {
        fprintf(stderr, "%s: failed to program word %08x at %08x, reply = %08x\n",
            a->name, word, addr, response);
        exit(-1);
    }
}

/*
 * Flash write row of memory.
 */
static void mpsse_program_row(adapter_t *adapter, unsigned addr,
    unsigned *data, unsigned words_per_row)
{
    mpsse_adapter_t *a = (mpsse_adapter_t*) adapter;
    int i;

    if (debug_level > 0)
        fprintf(stderr, "%s: row program %u words at %08x\n",
            a->name, words_per_row, addr);
    if (! a->use_executive) {
        /* Without PE. */
        fprintf(stderr, "%s: slow flash write not implemented yet.\n", a->name);
        exit(-1);
    }

    /* Use PE to write flash memory. */
    /* Send command. */
    mpsse_sendCommand(a, ETAP_FASTDATA, 1); 

    mpsse_xferFastData(a, PE_ROW_PROGRAM << 16 | words_per_row, 0, 1);  // Data, don't read, immediate
    mpsse_xferFastData(a, addr, 0, 1);  /* Send address. */             // Data, don't read, immediate

    /* Download data. */
    for (i = 0; i < words_per_row; i++) {
        if ((i & 7) == 0)
            mpsse_flush_output(a);
        mpsse_xferFastData(a, *data++, 0, 0);   /* Send word. Don't read, not immediate */
    }
    mpsse_flush_output(a);

    unsigned response = get_pe_response(a);
    if (response != (PE_ROW_PROGRAM << 16)) {
        fprintf(stderr, "%s: failed to program row at %08x, reply = %08x\n",
            a->name, addr, response);
        exit(-1);
    }
}

/*
 * Verify a block of memory.
 */
static void mpsse_verify_data(adapter_t *adapter,
    unsigned addr, unsigned nwords, unsigned *data)
{
    mpsse_adapter_t *a = (mpsse_adapter_t*) adapter;
    unsigned data_crc, flash_crc;

    //fprintf(stderr, "%s: verify %d words at %08x\n", a->name, nwords, addr);
    if (! a->use_executive) {
        /* Without PE. */
        fprintf(stderr, "%s: slow verify not implemented yet.\n", a->name);
        exit(-1);
    }

    /* Use PE to get CRC of flash memory. */
    /* Send command. */
    mpsse_sendCommand(a, ETAP_FASTDATA, 1);

    mpsse_xferFastData(a, PE_GET_CRC << 16, 0, 1);  // Data, don't read, immediate
     /* Send address. */
    mpsse_xferFastData(a, addr, 0, 1);              // Data, don't read, immediate
    /* Send length. */
    mpsse_xferFastData(a, nwords * 4, 0, 1);        // Data, don't read, immediate

    unsigned response = get_pe_response(a);
    if (response != (PE_GET_CRC << 16)) {
        fprintf(stderr, "%s: failed to verify %d words at %08x, reply = %08x\n",
            a->name, nwords, addr, response);
        exit(-1);
    }
    flash_crc = get_pe_response(a) & 0xffff;

    data_crc = calculate_crc(0xffff, (unsigned char*) data, nwords * 4);
    if (flash_crc != data_crc) {
        fprintf(stderr, "%s: checksum failed at %08x: sum=%04x, expected=%04x\n",
            a->name, addr, flash_crc, data_crc);
        //exit(-1);
    }
}

/*
 * Initialize adapter F2232.
 * Return a pointer to a data structure, allocated dynamically.
 * When adapter not found, return 0.
 * Parameters vid, pid and serial are not used.
 */
adapter_t *adapter_open_mpsse(int vid, int pid, const char *serial, 
                                int interface, int speed)
{
    mpsse_adapter_t *a;
    unsigned char product [256];
    int i;

    a = calloc(1, sizeof(*a));
    if (! a) {
        fprintf(stderr, "adapter_open_mpsse: out of memory\n");
        return 0;
    }
    a->context = NULL;
    int ret = libusb_init(&a->context);

    if (ret != 0) {
        fprintf(stderr, "libusb init failed: %d: %s\n",
            ret, libusb_strerror(ret));
        exit(-1);
    }

    for (i = 0; devlist[i].vid; i++) {
        a->usbdev = libusb_open_device_with_vid_pid(a->context, devlist[i].vid, devlist[i].pid);
        if (a->usbdev != NULL) {
            int match = 1;
            if (devlist[i].product != NULL) {

                struct libusb_device_descriptor desc = {0};
                int rc = libusb_get_device_descriptor(libusb_get_device(a->usbdev), &desc);
                if (rc != 0) {
                    match = 0;
                } else {
                    rc = libusb_get_string_descriptor_ascii(a->usbdev, desc.iProduct, product, 256);

